<?php

return array (

    /*
    |--------------------------------------------------------------------------
    | superuser
    |--------------------------------------------------------------------------
    |
    | Any user with superuser permissions automatically has access to everything,
    | regardless of the user permissions and group permissions.
    |
    */

    'superuser' => 'полный доступ к админ. панели и всем елементам',

    /*
    |--------------------------------------------------------------------------
    | administrator
    |--------------------------------------------------------------------------
    |
    | Разрешает доступ в админку
    |
    */

    'administrator' => 'доступ в админ. панель',

    /*
    |--------------------------------------------------------------------------
    | menu
    |------------------------------------------------------------------------
    */

    'page_create' => 'разрешение создавать страницы',
    'page_read' => 'разрешение просмотра страниц',
    'page_write' => 'разрешение редактирования страниц',
    'page_delete' => 'разрешение удаления страниц',

    'news_create' => 'разрешение создавать новости',
    'news_read' => 'разрешение просмотра новостей',
    'news_write' => 'разрешение редактирования новостей',
    'news_delete' => 'разрешение удаления новостей',

    'menu_create' => 'разрешение создавать меню',
    'menu_read' => 'разрешение просмотра меню',
    'menu_write' => 'разрешение редактирования меню',
    'menu_delete' => 'разрешение удаления меню',

    'banner_create' => 'разрешение создавать банеры',
    'banner_read' => 'разрешение просмотра банеров',
    'banner_write' => 'разрешение редактирования банеров',
    'banner_delete' => 'разрешение удаления банеров',

    'textwidget_create' => 'разрешение создавать текстовые виджеты',
    'textwidget_read' => 'разрешение просмотра текстовых виджетов',
    'textwidget_write' => 'разрешение редактирования текстовых виджетов',
    'textwidget_delete' => 'разрешение удаления текстовых виджетов',

    'productable_create' => 'разрешение создавать элементы виджета хитов продаж',
    'productable_read' => 'разрешение просмотра элементов виджета хитов продаж',
    'productable_write' => 'разрешение редактирования элементов виджета хитов продаж',
    'productable_delete' => 'разрешение удаления элементов виджета хитов продаж',

    'variablevalue_read' => 'разрешение просмотра значений переменных',
    'variablevalue_write' => 'разрешение изменять значения переменных',
    'variable_create' => 'разрешение создавать переменные',
    'variable_read' => 'разрешение просмотра переменных',
    'variable_write' => 'разрешение редактирования переменных',
    'variable_delete' => 'разрешение удаления переменных',

    'translation_create' => 'разрешение просмотра переводов',
    'translation_write' => 'разрешение редактирования переводов',

    'user_create' => 'разрешение создавать пользователей',
    'user_read' => 'разрешение просмотра пользователей',
    'user_write' => 'разрешение редактирования пользователей',
    'user_delete' => 'разрешение удаления пользователей',
    'user_group_write' => 'разрешение редактирования груп пользователя',

    'group_create'  => 'разрешение создавать групи',
    'group_read'  => 'разрешение просмотра груп',
    'group_write'  => 'разрешение редактирования груп',
    'group_delete'  => 'разрешение удаления груп',

    'bouquet_create'  => 'разрешение создавать букеты',
    'bouquet_read'  => 'разрешение просмотра букетов',
    'bouquet_write'  => 'разрешение редактирования букетов',
    'bouquet_delete'  => 'разрешение удаления букетов',

    'flower_create'  => 'разрешение создавать цветы',
    'flower_read'  => 'разрешение просмотра цветов',
    'flower_write'  => 'разрешение редактирования цветов',
    'flower_delete'  => 'разрешение удаления цветов',

    'box_create'  => 'разрешение создавать коробки',
    'box_read'  => 'разрешение просмотра коробок',
    'box_write'  => 'разрешение редактирования коробок',
    'box_delete'  => 'разрешение удаления коробок',

    'color_create'  => 'разрешение создавать цветов',
    'color_read'  => 'разрешение просмотра цвета',
    'color_write'  => 'разрешение редактирования цвета',
    'color_delete'  => 'разрешение удаления цвета',

    'category_create'  => 'разрешение создавать категории',
    'category_read'  => 'разрешение просмотра категорий',
    'category_write'  => 'разрешение редактирования категорий',
    'category_delete'  => 'разрешение удаления категорий',

    'order_create'  => 'разрешение создавать заказы',
    'order_read'  => 'разрешение просмотра заказов',
    'order_write'  => 'разрешение редактирования заказов',
    'order_paystatus' => 'разрешение изменять статус с/на "оплачен","оплачен другим способом"',

    'set_create'  => 'разрешение создавать наборы',
    'set_read'  => 'разрешение просмотра наборов',
    'set_write'  => 'разрешение редактирования наборов',
    'set_delete'  => 'разрешение удаления наборов',

    'product_create'  => 'разрешение создавать соп. товары',
    'product_read'  => 'разрешение просмотра соп. товаров',
    'product_write'  => 'разрешение редактирования соп. товаров',
    'product_delete'  => 'разрешение удаления соп. товаров',

    'subscription_create'  => 'разрешение создавать подписки',
    'subscription_read'  => 'разрешение просмотра подписок',
    'subscription_write'  => 'разрешение редактирования подписок',
    'subscription_delete'  => 'разрешение удаления подписок',

    'sale_create'  => 'разрешение создавать вирт. витрину',
    'sale_read'  => 'разрешение просмотра вирт. витрины',
    'sale_write'  => 'разрешение редактирования вирт. витрины',
    'sale_delete'  => 'разрешение удаления вирт. витрины',

    'individual_create'  => 'разрешение создавать инд. товары',
    'individual_read'  => 'разрешение просмотра инд. товаров',
    'individual_write'  => 'разрешение редактирования инд. товаров',
    'individual_delete'  => 'разрешение удаления инд. товаров',

    'code_create'  => 'разрешение создавать промо-коды',
    'code_read'  => 'разрешение просмотра промо-кодов',
    'code_write'  => 'разрешение редактирования промо-кодов',
    'code_delete'  => 'разрешение удаления промо-кодов',

    'discount_create'  => 'разрешение создавать скидки',
    'discount_read'  => 'разрешение просмотра скидок',
    'discount_write'  => 'разрешение редактирования скидок',
    'discount_delete'  => 'разрешение удаления скидки',
);
